package MyMemo;

/*
 23-05-15
 --study-
 자료연결, 깃공부, jdk 글쓰기, 노션 공부
 포폴 만들어두기(소켓, 크롤링), 교재 진도공부
 자바 복습(스트림버퍼, 제네릭, 소켓..등등)


--개인--
여행 준비 : 면세, 옷, 기념품리스트
개발자 : 목표 및 로드맵 구체화


*/


/* 
   자바의 다형성, 오라클=index
   JVM<JRE<JDK
   이란 뭘까??
   JVM(Java Virtual Machine) : 자바와 운영체제 사이에서 중개자 역할을 해주는 소프트웨어로 운영체제의 종류에 구에 받지 않고
   프로그램을 실행할 수 있도록 도와줍니다
   
   구조
   .java(자바코드) -> javac(컴파일러) -> .class(바이트코드)
   이걸 각각의 환경에 맞게 설치된 jvm에 전달 실행
   
   gc로 자동 메모리 관리도 해준다
   레지스터 기반이 아니라 스택 기반
   java
   https://steady-coding.tistory.com/305
   
   
   JRE
   
   JDK
   
   
 */

